Revit 2026 API

# SpacingRuleOffset Property

---

An additional offset applied to the first gridline.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Offset { get; set; }
```
```vb
Public Property Offset As Double
	Get
	Set
```
```cpp
public:
property double Offset {
	double get ();
	void set (double value);
}
```
```fsharp
member Offset : float with get, set
```

#### Property Value

Double

Measured in feet. Must be between -30000' and 30000'.

#### Reference

SpacingRule Class

Autodesk.Revit.DB Namespace